IDEA Open Model
FemElement Constructor (Int32, Int32, Int32)
Compatible with IDEA StatiCa v 10.1
 Constructor for triangular element 2d
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public FemElement(
	int node1,
	int node2,
	int node3
)
Public Sub New (
	node1 As Integer,
	node2 As Integer,
	node3 As Integer
)
public:
FemElement(
	int node1,
	int node2,
	int node3
)
Parameters
node1
Type: System.Int32
[Missing <param name="node1"/> documentation for "M:IdeaRS.OpenModel.Result.FemElement.#ctor(System.Int32,System.Int32,System.Int32)"]
node2
Type: System.Int32
[Missing <param name="node2"/> documentation for "M:IdeaRS.OpenModel.Result.FemElement.#ctor(System.Int32,System.Int32,System.Int32)"]
node3
Type: System.Int32
[Missing <param name="node3"/> documentation for "M:IdeaRS.OpenModel.Result.FemElement.#ctor(System.Int32,System.Int32,System.Int32)"]
See Also
Reference
FemElement Class
FemElement Overload
IdeaRS.OpenModel.Result Namespace